{
  "profileCard": {
    "ptb": {
      "age": "{replace_age} anos",
      "ageShort": "{replace_age}",
      "yearsExperience": "{replace_year} anos de experiencia",
      "yearsExperienceShort": "{replace_year}",
      "coffee": "{replace_cups} xícaras de café",
      "coffeeShort": "{replace_cups}",
      "hint": "Passe o mouse ou toque para revelar",
      "location": "Curitiba, Brasil",
      "position": "Eng. de Software"
    },
    "eng": {
      "age": "{replace_age} years old",
      "ageShort": "{replace_age}",
      "yearsExperience": "{replace_year} years of experience",
      "yearsExperienceShort": "{replace_year}",
      "coffee": "{replace_cups} Cups of coffee",
      "coffeeShort": "{replace_cups}",
      "hint": "Hover/touch the bars to reveal",
      "location": "Curitiba, Brazil",
      "position": "Software Engineer"
    }
  },
  "headerGreeting": {
    "ptb": {
      "title": "Olá, é ótimo vê-lo por aqui!",
      "text": "Atualmente, faço parte da equipe de desenvolvedores da Logcomex, uma empresa focada em inteligência no comércio exterior e logística internacional. Meu trabalho envolve a construção de soluções de software escaláveis para apresentar informações de maneira inteligente e personalizável, criando dashboards para análises comparativas, visualizações detalhadas e muitos outros insights, utilizando dados do nosso data warehouse, no estilo (BI).\n\nMinha primeira experiência com programação foi com o PHP, por volta de 2015, enquanto eu estava obtendo meu primeiro diploma de técnico em informática. Posteriormente, trabalhei com Java (EE), desenvolvendo e mantendo aplicações web, inicialmente em uma abordagem monolítica com Java e Primefaces no JSF e, posteriormente, com APIs Java e outros frameworks no frontend com JS.\n\nNos últimos anos, meu paradigma de programação mudou novamente, e passei a trabalhar com microserviços aqui na Logcomex. Isso foi muito enriquecedor para minha carreira, devido ao desafio de orquestrar e coreografar serviços, bem como trabalhar com diferentes linguagens na mesma infraestrutura. Atualmente, na minha equipe, mantenho principalmente serviços em PHP (Lumen/Laravel) e Python (FastAPI), e meu trabalho se concentra principalmente no backend, fornecendo insights de arquitetura e desenvolvendo soluções."
    },
    "eng": {
      "title": "Hello, it's great to see you here!",
      "text": "Currently, I'm a part of the development team at Logcomex, a company focused on intelligence in foreign trade and international logistics. My work involves building scalable software solutions to present information in an intelligent and customizable manner, creating dashboards for comparative analysis, detailed visualizations, and many other insights using information from our data warehouse in a BI fashion.\n\nMy first experience with programming was with PHP, around 2015, while I was pursuing my IT Technician degree. Later on, I worked with Java (EE), developing and maintaining web servers, initially in a monolithic approach with Java and Primefaces in JSF, and later with Java APIs and other frameworks on the frontend with JS.\n\nIn more recent years, my programming paradigm shifted once again, and I started working with microservices here at Logcomex. This has been very enriching for my career, given the challenge of orchestrating and choreographing those services, as well as working with different languages in the same infrastructure. Currently, in my team, I primarily maintain services in PHP (Lumen/Laravel) and Python (FastAPI), and my work mainly focuses on the backend, providing architectural insights and developing solutions."
    }
  },
  "experiences": {
    "ptb": {
      "title": "Experiência Profissional",
      "logcomexCard": {
        "title": "Logcomex",
        "badge": "Atualmente",
        "leftPanelInfo": {
          "time": "menos de 1 ano",
          "area": "Logística e Comex",
          "field": "Projetos",
          "methodology": "SCRUM"
        },
        "rightPaneInfo": {
          "experienceTitle": "Fullstack Software Engineer",
          "experienceText": "Após anos de experiência trabalhando com monolitos Java, recebi o convite da Logcomex para auxiliar na revolução do setor de Logística e Comércio Exterior. Diferente de tudo o que já havia trabalhando, tanto tecnicamente quanto negocialmente, a Log possui uma stack tecnologica bastante diversificada, o que logo de cara foi um desafio e sinto que a cada dia aprendo sempre um pouquinho mais. Ritmo de startup e todo mundo engajado para trazer o resultado, está sendo uma ótima experiência trabalhar com essa equipe incrível 💖"
        }
      },
      "everisCard": {
        "title": "Everis Brazil - NTT DATA",
        "badge": "Atualmente",
        "leftPanelInfo": {
          "time": "2 anos +",
          "area": "Telecom",
          "field": "Sustentação/Projetos",
          "methodology": "Cascata"
        },
        "rightPaneInfo": {
          "experienceTitle": "Desenvolvedor Java JR.",
          "experienceText": "Minha contribuição com a everis pode ser dividida em duas etapas principais:\n\n1 - Trabalhando para o cliente Telefônica (retail) na área de BSS (Business Support Services) e CRM (Customer Relationship Management) no suporte de nível N2 e N3. Grande parte desse trabalho envolvia a atualização de dados em produção em tempo real, atuando para desbloquear e possibilitar o negócio dentro do SLA de Sustentação. Nessa experiência, aprendi a trabalhar com eficiência e cuidado, bem como aprimorei minhas habilidades em SQL e PL/SQL ao trabalhar com bases de dados Oracle.\n\n2 - Trabalhando para o cliente Telefônica (corporate) na área corporativa de desenvolvimento de sistemas. Nessa fase da experiência, tive o prazer de trabalhar em uma equipe com experiência avançada, onde pude aprimorar ainda mais meus conhecimentos de programação. Também atendi a uma demanda de desenvolvimento em Siebel, algo que nunca havia feito antes."
        }
      },
      "sigmaCard": {
        "title": "Sigma dataserv",
        "badge": "Atualmente",
        "leftPanelInfo": {
          "time": "1 ano +",
          "area": "Governo",
          "field": "Projetos",
          "methodology": "Cascata"
        },
        "rightPaneInfo": {
          "experienceTitle": "Desenvolvedor Java JR.",
          "experienceText": "Sigma foi a minha primeira experiência em desenvolvimento web. Essa experiência elevou tanto minhas habilidades interpessoais quanto técnicas para um novo patamar. Sendo apresentado a novos desafios todos os dias, minha jornada na Sigma foi repleta de obstáculos, mas eu estava cercado por pessoas talentosas e experientes das quais aprendi muito. Sou eternamente grato por essa experiência e pela quantidade de aprendizado que obtive dela."
        }
      }
    },
    "eng": {
      "title": "Professional Experience",
      "logcomexCard": {
        "title": "Logcomex",
        "badge": "Currently",
        "leftPanelInfo": {
          "time": "Less than a year",
          "area": "Logística e Comex",
          "field": "Projetos",
          "methodology": "SCRUM"
        },
        "rightPaneInfo": {
          "experienceTitle": "Fullstack Software Engineer",
          "experienceText": "After years working with monolithic Java, i was invited to contribute with Logcomex's revolution on Logitics and International Commerce. This experience turned out to be a challenge, right off the bat. They're different of everything i worked with before, both tecnically and business speaking, making me feel like everyday i learn something new. A startup paced work surrounded with awesome talented people compromised to bring results to the table. It's been a pleasure work here 💖"
        }
      },
      "everisCard": {
        "title": "Everis Brazil - NTT DATA",
        "badge": "Currently",
        "leftPanelInfo": {
          "time": "2 years +",
          "area": "Telecom",
          "field": "Sustainability",
          "methodology": "Waterfall"
        },
        "rightPaneInfo": {
          "experienceTitle": "Java Developer JR.",
          "experienceText": "My contribution to everis can be split into two main stages:\n\n1 - Working for customer Telefônica (retail) in the BSS (Business Support Services) and CRM (Customer Relationship Management) area, providing N2 and N3 support. Much of this work involved real-time data updates in production, working to unlock and enable business operations within Support SLAs. In this experience, I learned to work efficiently and meticulously, as well as further developed my SQL and PL/SQL skills while working with Oracle databases.\n\n2 - Working for customer Telefônica (corporate) system development area. In this stage of my experience, I had the pleasure of working in a team with advanced expertise coworkers, where I could further enhance my programming knowledge. I was also assigned to develop a feature in Siebel, something I had never done before."
        }
      },
      "sigmaCard": {
        "title": "Sigma dataserv",
        "badge": "Currently",
        "leftPanelInfo": {
          "time": "1 year +",
          "area": "Government",
          "field": "Projects",
          "methodology": "Waterfall"
        },
        "rightPaneInfo": {
          "experienceTitle": "Java Developer JR.",
          "experienceText": "Sigma was my first experience in web development. This experience elevated both my soft and hard skills to a new level. Introduced to new problems everyday, my journey at Sigma was full of challenges, but i was surrounded of talented experienced people from whom i learned a lot from. I'm forever grateful for this experience and for the amount of learning i took from it."
        }
      }
    }
  },
  "academicHistory": {
    "ptb": {
      "title": "Histórico Acadêmico",
      "speiCard": {
        "cardTitle": "Colégio SPEI",
        "course": "Tec. em Informática",
        "hoverCourse": "Técnico em Informática",
        "attendance": "2012 - 2015",
        "status": "Concluído"
      },
      "opetCard": {
        "cardTitle": "Faculdades OPET",
        "course": "TADS",
        "hoverCourse": "Análise e Desenvolvimento de Sistemas",
        "attendance": "2019 - 2021",
        "status": "Concluído"
      }
    },
    "eng": {
      "title": "Academic History",
      "speiCard": {
        "cardTitle": "SPEI School",
        "course": "Information Technician",
        "hoverCourse": "",
        "attendance": "2012 - 2015",
        "status": "Complete"
      },
      "opetCard": {
        "cardTitle": "OPET College",
        "course": "System A.D",
        "hoverCourse": "System Analysis and Development",
        "attendance": "2019 - 2021",
        "status": "Complete"
      }
    }
  },
  "showcase": {
    "ptb": {
      "title": "Projetos",
      "description": "Com o passar dos anos, fui acumulando alguns projetos pessoais e acadêmicos os quais foram divertidos de serem desenvolvidos. Nesta seção gostaria de mostrar alguns desses pequenos projetos.",
      "sonicCard": {
        "leftPanelInfo": {
          "date": "2018 - WIP",
          "type": "Jogo",
          "category": "Pessoal"
        },
        "rightPanelInfo": {
          "title": "Sonic Phaser Game",
          "text": "O saudoso porco-espinho azul sempre foi um personagem muito presente na minha infância. Me lembro de passar horas jogando titulos como Sonic the hedgehog, Sonic 3, Sonic 3D e outros da saga. Em 2018 participei de um Workshop interno da empresa onde o foco era JavaScript, então resolvi dar uma tentativa e dar vida ao personagem. O jogo acabou ficando em um estágio bem inicial, muito tempo foi consumido desenvolvendo os conceitos de física para andar e animações do personagem."
        }
      },
      "tinmanCard": {
        "leftPanelInfo": {
          "date": "2021 - WIP",
          "type": "Portfólio",
          "category": "Terceiros"
        },
        "rightPanelInfo": {
          "title": "Tinman Art - Portfolio",
          "text": "Desde muito cedo, meu primo já possuia aptidão para o desenho, algo que sempre foi muito presente em nossa familia. Após muito treinamento e ponderamento, ele optou por seguir na área de Design, visando sempre que pode, aprimorar suas habilidades na ilustração e um dia trabalhar apenas com suas artes e desenhos. Pensando nisso, ele me trouxe a ideia de criar um portfólio em que ele pudesse mostrar suas artes, de maneira simples e rápida, mas não menos elegante. Assim, depois de algumas brainstorms de ideias chegamos em um formato similar a este site meu, porém totalmente voltado para as artes dele. Sinta-se a vontade para conferir nosso trabalho. Se algo estiver meio fora do lugar, pedimos desculpa pois ainda está em um estágio inicial 😇"
        }
      },
      "guessTheColorCard": {
        "leftPanelInfo": {
          "date": "2017",
          "type": "Jogo",
          "category": "Pessoal"
        },
        "rightPanelInfo": {
          "title": "Um jogo(ou quase) de adivinhar cores",
          "text": "Neste pequeno projeto você sente na pele a emoção de ser o Akinator, lembra daquele geniozinho que advinha qual personagem você está pensando ? Porém agora é você quem deve advinhar. Parece que jogo virou não é mesmo ?! Tente advinhar o que a máquina está pensando. Mas não tente demais pois acabou que não dei tanta atenção ao refinar as dicas e até na validação das respostas, só pra brincar mesmo 😋"
        }
      },
      "calculatorCard": {
        "leftPanelInfo": {
          "date": "2017",
          "type": "Utilidade",
          "category": "Pessoal"
        },
        "rightPanelInfo": {
          "title": "Calculadora simples com JS+HTML",
          "text": "Como não poderia deixar de ser, um dos meus primeiros projetos pessoais foi uma calculadora utilizando JS, Bootstrap e CSS para estilização dos tamanhos. Ela possui um funcionamento básico, apenas com as funções principais, não possui nem a função de multiplicação. Pensei em alterar e aprimorar (e resolver bugs) um pouco mais esse projeto apenas para mostrar aqui, mas meio que iria perder a essência histórica."
        }
      }
    },
    "eng": {
      "title": "Showcase",
      "description": "Over the years I've accumulated some personal and academic projects I had fun going through. In this section I'd like to show you some of those projects.",
      "tinmanCard": {
        "leftPanelInfo": {
          "date": "2021 - WIP",
          "type": "Portfolio",
          "category": "Others"
        },
        "rightPanelInfo": {
          "title": "Tinman Art - Portfolio",
          "text": "Since his young age, my cousin already had a gift for drawing, something that has been present in my family for decades. After practice and giving some thought into, he decided he should go on the pursuit of his Design degree, but never giving up to enhance his illustration skills, hoping someday work with his arts and drawings. After some water went under the bridge, he came to me with this idea of putting together a portfolio, whose he could display his arts, in a simple and fast yet fancy way. So, after some brainstorms we came up with a similar design of this site, but with the attention completely turned onto his arts. Please, take a look at our work. If something feels a bit out of place, we apologize, it is still in early stages 😇"
        }
      },
      "sonicCard": {
        "leftPanelInfo": {
          "date": "2018 - WIP",
          "type": "Game",
          "category": "Personal"
        },
        "rightPanelInfo": {
          "title": "Sonic Phaser Game",
          "text": "The nostalgic blue hedgehog were always present in my childhood. I have memories of spending hours and hours playing games of the Sonic franchise. On 2018, I attended to an internal workshop in my company focused on the JavaScript language, so I decided I should give it a try and relive him once again in my personal project. This project was really fun to begin, up until this day it remains in a very early stage, much of the time was used to develop the base concepts to walk, jump and animate the character."
        }
      },
      "guessTheColorCard": {
        "leftPanelInfo": {
          "date": "2017",
          "type": "Game",
          "category": "Personal"
        },
        "rightPanelInfo": {
          "title": "Dummy Guess The Color Game(ish?)",
          "text": "In this project you get in the shoes of Akinator, that genie that guesses what character you're thinking on. But now you have to guess what the machine is thinking of. Funny how the tables turn huh ? Take your chances and try to guess, but don't try to hard because it's not so well developed and it has somes bugs 😋"
        }
      },
      "calculatorCard": {
        "leftPanelInfo": {
          "date": "2017",
          "type": "Utility",
          "category": "Personal"
        },
        "rightPanelInfo": {
          "title": "Dummy JS+HTML Calculator",
          "text": "It couldn't be different ! One of my first personal projects was a dummy calculator using JS, Bootstrap and CSS for styling sizes. It does the basics, it has only the main operations of a simple calculator,but it doesn't even have the multiplication function sadly. I planned on giving it some more love and refactoring it (solve some bugs and stuff like that) to display it here, but it kinda would lose its historic purpose."
        }
      }
    }
  },
  "talks": {
    "ptb": {
      "title": "Palestras"
    },
    "eng": {
      "title": "Talks"
    }
  }
}
